// Задание 1
// Создать переменные num1, num2 которые пользователь вводит с клавиатуры
// Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.

alert(" Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.");
const num1 = +prompt("Введите первое число");
const num2 = +prompt("Введите второе число");
(num1 <= 1 && num2 >= 3) ? alert("Первое число меньше или рано 1,а второе больше или рано 3") : alert("Условие не соблюдается");

// Задание 2
// Перепишите код к тернарному оператору

// let test = true;
// if (test === true) {
// console.log('+++');
// } else {
// console.log('---');
// }

let test = true;
(test === true) ? console.log('+++') : console.log('---');


// Задание 3
// В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).


const day = +prompt("Введите дату от 1 до 31");
if (1 <= day && day <= 10) {
    alert("Первая декада");
} else {
    if (10 < day && day <= 20) {
        alert("Вторая декада");
    } else {
        if (20 < day && day <= 31) {
            alert("Третья декада");
        } else {
            alert("Введите корректную дату!");
        }
    }
}

// Задание 4
// Необязательное задание. (Если вам показалось домашнее задание простым, выполняем данный пункт)
// (Для решения задания вам потребуется оператор остаток от деления %, например 10%3 === 1 , десять разделить на 3, остаток 1, второй пример 7 % 5, тут остаток от деления будет 2, ну и 3 пример это 14 % 10 === 4, остаток от деления на 10 будет равен 4)

// Необходимо от пользователя получить число.
// Необходимо вывести разряды числа, а именно: количество сотен, десятков и единиц.

// Пример:
// Пользователь ввел число 163. Программа должна вывести:
// "В числе 163 количество сотен: 1, десятков: 6, единиц: 3"

// Пример 2:
// Пользователь ввел число 74. Программа должна вывести:
// "В числе 74 количество сотен: 0, десятков: 7, единиц: 4"

// Пример 3:
// Пользователь ввел число 9537. Программа должна вывести:
// "В числе 9537 количество сотен: 5, десятков: 3, единиц: 7"

// Уточнение: пользователь всегда вводит корректное положительное целое число.


const number = +prompt("Введите число:")
alert(`В числе ${number} количество сотен: ${(number % 1000 - number % 100) / 100} ,десятков ${(number % 100 - number % 10) / 10}, единиц ${number % 10} `)